//#####################################################################################################################
//#####################################################################################################################
//###############################               Формы - блок алгоритмов                 ###############################
//#####################################################################################################################
//####    Автор: Кулишов Илья Вячеславович    #########################################################################
//####    Версия: v.0.0.0.1                   #########################################################################
//####    Дата: 08.04.2024                    #########################################################################
//#####################################################################################################################
//#####################################################################################################################


//=====================================================================================
//Функция поиска пользователя по id
//Входные данные:
//                      id:Int          - адресс
//Возращаемое значение:
//                      ret:User        - пользователь
//=====================================================================================
fun findUser(id:Int):User{
    var userRet:User=User(-1, "Error", "Error", "-1",-1)
    for(user in userList){
        if(id == user.id)  userRet=user
    }
    return userRet
}

//=====================================================================================
//Функция поиска заяыки по id
//Входные данные:
//                      id:Int          - адресс
//Возращаемое значение:
//                      ret:Int        - адресс
//=====================================================================================
fun findApplic(id:Int):Int{
    var applicRet:Int=0
    var i = 0
    for(applic in ApllicArray){
        i++
        if(id == applic.id)  applicRet=i
    }
    return applicRet
}

//=====================================================================================
//Функция поиска подстрок в строке
//Входные данные:
//                      user:String          - список категорий у пользователя
//                      kategkod:String      - категория
//Возращаемое значение:
//                      ret:Boolean          - да/нет
//=====================================================================================
fun findStrStr(user:String, kategkod:String):Boolean{
    var strTek=""
    var ret=false
    for(x in user){
        if(x=='_'){
            strTek=""
        }
        else{
            strTek+=x
        }
        if(strTek==kategkod) ret=true
    }
    return ret
}